# GetConvertedFabricationParts Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DesignToFabricationConverter..::..GetConvertedFabricationParts Method
DesignToFabricationConverter Class See Also
---
Gets the set of element identifiers for newly created fabrication parts.
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public ISet<ElementId> GetConvertedFabricationParts()
```

Visual Basic
---
```text
Public Function GetConvertedFabricationParts As ISet(Of ElementId)
```

Visual C++
---
```text
public:
ISet<ElementId^>^ GetConvertedFabricationParts()
```

# Remarks
This set of element identifiers is only available after the **Convert** method has been invoked.
# See Also
DesignToFabricationConverter Class
Autodesk.Revit.DB.Fabrication Namespace